def taxi(a: str, b: str, time_: tuple):
    length = {'работа-дом': 12.8,
              'работа-магазин': 4.6,
              'работа-спортзал': 2.9,
              'дом-работа': 12.8,
              'дом-магазин': 3.7,
              'дом-спортзал': 5.1,
              'магазин-работа': 4.6,
              'магазин-дом': 3.7,
              'магазин-спортзал': 4.1,
              'спотрзал-дом': 5.1,
              'спотрзал-магазин': 4.1,
              'спотрзал-работа': 2.9}
    ride = f'{a}-{b}'
    time_zone = {'Зеленая': 100,
                 'Желтая': 200,
                 'Красная': 300,
                }

    if 0 <= time_[0] <= 7 and 0 <= time_[1] <= 59:
        time_ride = 'Зеленая'      # минуты нужны если зоны делятся не ровно по часам
    elif (10 <= time_[0] <= 16 and 0 <= time_[1] <= 59) or (20 <= time_[0] <= 23 and 0 <= time_[1] <= 59):
        time_ride = 'Желтая'
    elif (8 <= time_[0] <= 9 and 0 <= time_[1] <= 59) or (17 <= time_[0] <= 19 and 0 <= time_[1] <= 59):
        time_ride = 'Красная'
    else:
        raise ValueError('Некорректно задано время')
    price = length.get(ride) * time_zone.get(time_ride)
    return price


price = taxi('работа', 'магазин', (17, 8))
print(f"Стоимость поездки: {price} рублей")
